- Uses in modern, enterprise network
- __Layer 3 Switches__ 
	- Uses hardware-based switching
	- Route between VLANs using multiple SVIs
	- Convert L2 ports into L3 interfaces (similar to Router interfaces)
- Configure SVIs on L3 switch
``interface vlan 'vlan-id'``

__Example:__   
<img width="1284" height="718" alt="Screenshot 2025-12-02 155815" src="https://github.com/user-attachments/assets/2e3b663a-9258-4239-95c6-121885a3f36f" />

| VLAN Interface | IP Address      |
| -------------- | --------------- |
| 10             | 192.168.10.1/24 |
| 20             | 192.168.20.1/24 |

___Steps:___
1. Create the VLANs
```
D1(config)# vlan 10
D1(config-vlan)# name LAN10
D1(config-vlan)# vlan 20
D1(config-vlan)# name LAN20
D1(config-vlan)# exit
```
2. Create the SVIs VALN Interfaces
```
D1(config)# interface vlan 10
D1(config-if)# description Default Gateway SVI for 192.168.10.0/24
D1(config-if)# ip add 192.168.10.1 255.255.255.0
D1(config-if)# no shut
D1(config-if)# exit
D1(config)# int vlan 20
D1(config-if)# ip add 192.168.20.1 255.255.255.0
D1(config-if)# no shut
D1(config-if)# exit
```
3. Configure access ports
```
D1(config)# interface g1/0/6
D1(config-if)# switchport mode access
D1(config-if)# switchport access vlan 10
D1(config-if)# exit
D1(config)# interface g1/0/18
D1(config-if)# switchport mode access
D1(config-if)# switchport acces vlan 20
```
4. Enable IP routing
```
D1(config)# ip routing
```

## ___Routing on Layer 3 Switch___
- Must be advertised using __static__ or __dynamic__ routing
- Create a routing port on L3 Switch
``no switchport``


