## ___VLAN Range on Catalyst Switches___
- __Catalyst 2960 and 3650__ - over 4000 VLANs
- __Normal range__
	- 1 - 1005
	- Configurations stored in vlan.data (flash memory in VLAN database)
	- _VTP(VLAN Trunking Protocol_ - helps synchronize the VLAN database when configured
- __Extended range__
	- 1006 - 4094
	- Configuration saved, by default, in running-config
	- Support fewer VLAN features
- Note: Max. num of VLAN = 4096 (12b ID) 
`` Switch# show vlan brief`` - show all VLANs

## ___VLAN Creation Commands___

```
S1(config)# vlan <vlan-id>
S1(config-vlan)# name <vlan-name>
S1(config-vlan)# end
```

## ___VLAN Port Assigned Command___
```
S1(config)# interface <interface-id>
S1(config-if)# switchport mode access
S1(config-if)# switchport access vlan <vlan-id>
S1(config-if)# end
```

## ___Data and Voice VLANs___
- Port can be associated to a voice VLAN
__Example:__
```
S1(config)# vlan 20
S1(config-vlan)# name student
S1(config-vlan)# vlan 150
S1(config-vlan)# name VOICE
S1(config-vlan)# exit
S1(config)# interface fa0/18
S1(config-if)# switchport mode access
S1(config-if)# switchport access vlan 20
S1(config-if)# mls qos trust cos
S1(config-if)# switchport access vlan 150
S1(config-if)# end
```

## ___Verify VLAN Information___
```
show brief
show id 20
show name student
show summary
```

## ___Change VLAN Port Membership__
```
S1# show interface f0/18 switchport 
S1(config)# (no) switchport access vlan 20
```

## ___Delete VLAN___
- Normal Delete:
```
S1(config)# no vlan 20
```
- Delete flash file:
```
S1# delete flash:vlan.dat
S1# relode
```
- Erase to default settings:
```
S1# erase startup-config
S1# delete vlan.dat
S1# relode
```